espressif/esp-idf/components/soc/esp32p4/include/soc/spi_mem_s_struct.h
/** Group: External mem cryption DPA registers */
/** Type of mem_dpa_ctrl register
 *  SPI memory cryption DPA register
 */
typedef union {
    struct {
        /** crypt_security_level : R/W; bitpos: [2:0]; default: 7;
         *  Set the security level of spi mem cryption. 0: Shut off cryption DPA funtion. 1-7:
         *  The bigger the number is, the more secure the cryption is. (Note that the
         *  performance of cryption will decrease together with this number increasing)
         */
        uint32_t crypt_security_level:3;
        /** crypt_calc_d_dpa_en : R/W; bitpos: [3]; default: 1;
         *  Only available when SPI_CRYPT_SECURITY_LEVEL is not 0. 1: Enable DPA in the
         *  calculation that using key 1 or key 2. 0: Enable DPA only in the calculation that
         *  using key 1.
         */
        uint32_t crypt_calc_d_dpa_en:1;
        /** crypt_dpa_select_register : R/W; bitpos: [4]; default: 0;
         *  1: MSPI XTS DPA clock gate is controlled by SPI_CRYPT_CALC_D_DPA_EN and
         *  SPI_CRYPT_SECURITY_LEVEL. 0: Controlled by efuse bits.
         */
        uint32_t crypt_dpa_select_register:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} spi_mem_s_dpa_ctrl_reg_t;


/** Group: Version control register */
/** Type of mem_date register
 *  SPI0 version control register
 */
typedef union {
    struct {
        /** mem_date : R/W; bitpos: [27:0]; default: 36712704;
         *  SPI0 register version.
         */
        uint32_t mem_date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} spi_mem_s_date_reg_t;


typedef struct spi_mem_s_dev_s {
    volatile spi_mem_s_cmd_reg_t mem_cmd;
    uint32_t reserved_004;
    volatile spi_mem_s_ctrl_reg_t mem_ctrl;
    volatile spi_mem_s_ctrl1_reg_t mem_ctrl1;
    volatile spi_mem_s_ctrl2_reg_t mem_ctrl2;
    volatile spi_mem_s_clock_reg_t mem_clock;
    volatile spi_mem_s_user_reg_t mem_user;
    volatile spi_mem_s_user1_reg_t mem_user1;
    volatile spi_mem_s_user2_reg_t mem_user2;
    uint32_t reserved_024[4];
    volatile spi_mem_s_misc_reg_t mem_misc;
    uint32_t reserved_038;
    volatile spi_mem_s_cache_fctrl_reg_t mem_cache_fctrl;
    uint32_t reserved_040;
    volatile spi_mem_s_sram_cmd_reg_t mem_sram_cmd;
    uint32_t reserved_048[3];
    volatile spi_mem_s_fsm_reg_t mem_fsm;
    uint32_t reserved_058[26];
    volatile spi_mem_s_int_ena_reg_t mem_int_ena;
    volatile spi_mem_s_int_clr_reg_t mem_int_clr;
    volatile spi_mem_s_int_raw_reg_t mem_int_raw;
    volatile spi_mem_s_int_st_reg_t mem_int_st;
    uint32_t reserved_0d0;
    volatile spi_mem_s_ddr_reg_t mem_ddr;
    volatile spi_mem_s_smem_ddr_reg_t smem_ddr;
    uint32_t reserved_0dc[9];
    volatile spi_mem_s_fmem_pmsn_attr_reg_t fmem_pmsn_attr[4];
    volatile spi_mem_s_fmem_pmsn_addr_reg_t fmem_pmsn_addr[4];
    volatile spi_mem_s_fmem_pmsn_size_reg_t fmem_pmsn_size[4];
    volatile spi_mem_s_smem_pmsn_attr_reg_t smem_pmsn_attr[4];
    volatile spi_mem_s_smem_pmsn_addr_reg_t smem_pmsn_addr[4];
    volatile spi_mem_s_smem_pmsn_size_reg_t smem_pmsn_size[4];
    uint32_t reserved_160;
    volatile spi_mem_s_pms_reject_reg_t mem_pms_reject;
    volatile spi_mem_s_ecc_ctrl_reg_t mem_ecc_ctrl;
    volatile spi_mem_s_ecc_err_addr_reg_t mem_ecc_err_addr;
    volatile spi_mem_s_axi_err_addr_reg_t mem_axi_err_addr;
    volatile spi_mem_s_smem_ecc_ctrl_reg_t smem_ecc_ctrl;
    volatile spi_mem_s_smem_axi_addr_ctrl_reg_t smem_axi_addr_ctrl;
    volatile spi_mem_s_axi_err_resp_en_reg_t mem_axi_err_resp_en;
    volatile spi_mem_s_timing_cali_reg_t mem_timing_cali;
    volatile spi_mem_s_din_mode_reg_t mem_din_mode;
    volatile spi_mem_s_din_num_reg_t mem_din_num;
    volatile spi_mem_s_dout_mode_reg_t mem_dout_mode;
    volatile spi_mem_s_smem_timing_cali_reg_t smem_timing_cali;
    volatile spi_mem_s_smem_din_mode_reg_t smem_din_mode;
    volatile spi_mem_s_smem_din_num_reg_t smem_din_num;
    volatile spi_mem_s_smem_dout_mode_reg_t smem_dout_mode;
    volatile spi_mem_s_smem_ac_reg_t smem_ac;
    volatile spi_mem_s_smem_din_hex_mode_reg_t smem_din_hex_mode;
    volatile spi_mem_s_smem_din_hex_num_reg_t smem_din_hex_num;
    volatile spi_mem_s_smem_dout_hex_mode_reg_t smem_dout_hex_mode;
    uint32_t reserved_1b0[20];
    volatile spi_mem_s_clock_gate_reg_t mem_clock_gate;
    uint32_t reserved_204[63];
    volatile spi_mem_s_xts_plain_base_reg_t mem_xts_plain_base;
    uint32_t reserved_304[15];
    volatile spi_mem_s_xts_linesize_reg_t mem_xts_linesize;
    volatile spi_mem_s_xts_destination_reg_t mem_xts_destination;
    volatile spi_mem_s_xts_physical_address_reg_t mem_xts_physical_address;
    volatile spi_mem_s_xts_trigger_reg_t mem_xts_trigger;
    volatile spi_mem_s_xts_release_reg_t mem_xts_release;
    volatile spi_mem_s_xts_destroy_reg_t mem_xts_destroy;
    volatile spi_mem_s_xts_state_reg_t mem_xts_state;
    volatile spi_mem_s_xts_date_reg_t mem_xts_date;
    uint32_t reserved_360[7];
    volatile spi_mem_s_mmu_item_content_reg_t mem_mmu_item_content;
    volatile spi_mem_s_mmu_item_index_reg_t mem_mmu_item_index;
    volatile spi_mem_s_mmu_power_ctrl_reg_t mem_mmu_power_ctrl;
    volatile spi_mem_s_dpa_ctrl_reg_t mem_dpa_ctrl;
    uint32_t reserved_38c[28];
    volatile spi_mem_s_date_reg_t mem_date;
} spi_mem_s_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(spi_mem_s_dev_t) == 0x400, "Invalid size of spi_mem_s_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
